#include <stdio.h>
#define N 5

int graph[N][N] = {
    {0, 1, 0, 1, 0},  // 節點 0
    {1, 0, 1, 0, 1},  // 節點 1
    {0, 1, 0, 0, 1},  // 節點 2
    {1, 0, 0, 0, 0},  // 節點 3
    {0, 1, 1, 0, 0}   // 節點 4
};

int v[N];  // 紀錄已瀏覽的節點

void DFS(int n) {    // 接收一個「節點」參數
  v[n] = 1;          // 此節點設為已走訪
  printf("%d ", n);  // 顯示節點編號

  for (int i = 0; i < N; i++) {  // 對每個相鄰節點
    // 若有相鄰節點 且 尚未走訪
    if (graph[n][i] == 1 && v[i] == 0)
      DFS(i);  // 遞迴呼叫
  }
}

int main() {
  printf("走訪節點：");
  DFS(0);
}